# RiserThicknesssResetToZero Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..RiserThicknesssResetToZero Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Monolithic Stairs without Treads can't have Risers. Riser Thickness for Stairs Type was automatically set to zero.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RiserThicknesssResetToZero { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RiserThicknesssResetToZero As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RiserThicknesssResetToZero {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace